app/views/users/display_profile.html.erb

SELECT "instruments".* FROM "instruments" INNER JOIN "instruments_users" ON "instruments"."id" = "instruments_users"."instrument_id" WHERE "instruments_users"."user_id" = ?  [["user_id", 10]]
---
<%= image_tag(photo_file_name, size: "350") %>
<% @user.instruments.each do |instrument|%>

SELECT "genres".* FROM "genres" INNER JOIN "genres_users" ON "genres"."id" = "genres_users"."genre_id" WHERE "genres_users"."user_id" = ?  [["user_id", 10]]
---
<% end %>
<% @user.genres.each do |genre|%>

SELECT "activities".* FROM "activities" INNER JOIN "activities_users" ON "activities"."id" = "activities_users"."activity_id" WHERE "activities_users"."user_id" = ?  [["user_id", 1]]
---
<% end %>
<% @user.activities.each do |activity| %>

SELECT "interests".* FROM "interests" INNER JOIN "interests_users" ON "interests"."id" = "interests_users"."interest_id" WHERE "interests_users"."user_id" = ?  [["user_id", 1]]
---
<% end %>
<% @user.interests.each do |interest|%>