app/views/users/edit_profile.html.erb

SELECT  1 AS one FROM "instruments" INNER JOIN "instruments_users" ON "instruments"."id" = "instruments_users"."instrument_id" WHERE "instruments_users"."user_id" = ? AND "instruments"."id" = 4 LIMIT 1  [["user_id", 1]]
SELECT "instruments".* FROM "instruments"
---
    <% @instruments.each do |ins| %>
        <p><%= check_box_tag "instruments[]", ins.id, (@user.instruments.include? ins) %>

SELECT  1 AS one FROM "genres" INNER JOIN "genres_users" ON "genres"."id" = "genres_users"."genre_id" WHERE "genres_users"."user_id" = ? AND "genres"."id" = 1 LIMIT 1  [["user_id", 1]]
SELECT "genres".* FROM "genres"
---
    <% @genres.each do |g| %>
        <p><%= check_box_tag "genres[]", g.id, (@user.genres.include? g) %>

SELECT  1 AS one FROM "interests" INNER JOIN "interests_users" ON "interests"."id" = "interests_users"."interest_id" WHERE "interests_users"."user_id" = ? AND "interests"."id" = 1 LIMIT 1  [["user_id", 1]]
SELECT "interests".* FROM "interests"
---
    <% @interests.each do |i| %>
        <p><%= check_box_tag "interests[]", i.id, (@user.interests.include? i) %>

SELECT  1 AS one FROM "activities" INNER JOIN "activities_users" ON "activities"."id" = "activities_users"."activity_id" WHERE "activities_users"."user_id" = ? AND "activities"."id" = 1 LIMIT 1  [["user_id", 1]]
SELECT "activities".* FROM "activities"
---
    <% @activities.each do |a| %>
        <p><%= check_box_tag "activities[]", a.id, (@user.activities.include? a) %>