app/controllers/search_controller.rb

    def lookup
        if session[:curr_user_id] == nil
            redirect_to({controller: "welcome", action: "index"})
        end
        @user = User.find(session[:curr_user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 11]]