app/controllers/search_controller.rb

    def lookup
        if session[:curr_user_id] == nil
            redirect_to({controller: "users", action: "login"})
        end
        @instruments = Instrument.all
        @genres = Genre.all
        @interests = Interest.all
        @activities = Activity.all
---
SELECT "instruments".* FROM "instruments"
SELECT "genres".* FROM "genres"
SELECT "interests".* FROM "interests"
SELECT "activities".* FROM "activities"

    def display_results
        if session[:curr_user_id] != nil
            flash[:error_messages] = []
            @users = User.all.to_set - Set.new.add(User.find(session[:curr_user_id]))
            if params[:instruments] != nil
                @users = @users & User.joins(:instruments).where("instruments.id" => params[:instruments]).to_set
            end
            if params[:genres] != nil
                @users = @users & User.joins(:genres).where("genres.id" => params[:genres]).to_set
            end
            if params[:activities] != nil
                @users = @users & User.joins(:activities).where("activities.id" => params[:activities]).to_set
            end
            if params[:affiliations] != nil
                @users = @users & User.where("affiliation" => params[:affiliations])
            end
            if params[:level_anchors] != nil
                @users = @users & User.where("level_anchor" => params[:level_anchors])
            end
            if @users.size() == 0
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" INNER JOIN "instruments_users" ON "instruments_users"."user_id" = "users"."id" INNER JOIN "instruments" ON "instruments"."id" = "instruments_users"."instrument_id" WHERE "instruments"."id" IN (1, 2, 4)
SELECT "users".* FROM "users"  WHERE "users"."affiliation" IN ('AFFIL 1')
SELECT "users".* FROM "users" INNER JOIN "instruments_users" ON "instruments_users"."user_id" = "users"."id" INNER JOIN "instruments" ON "instruments"."id" = "instruments_users"."instrument_id" INNER JOIN "genres_users" ON "genres_users"."user_id" = "users"."id" INNER JOIN "genres" ON "genres"."id" = "genres_users"."genre_id" INNER JOIN "activities_users" ON "activities_users"."user_id" = "users"."id" INNER JOIN "activities" ON "activities"."id" = "activities_users"."activity_id" WHERE "instruments"."id" IN (SELECT "instruments"."id" FROM "instruments") AND "genres"."id" IN (SELECT "genres"."id" FROM "genres") AND "activities"."id" IS NULL AND "users"."level_anchor" IN ('Beginning', 'Amateur', 'Intermediate', 'Advanced', 'Expert')
SELECT "users".* FROM "users"