app/controllers/users_controller.rb

    def display_profile
        if params[:id] != nil
            @id = params[:id]
            @user = User.find(params[:id])
            userInstrumentSkills = InstrumentSkill.where(:user_id => @user.id)
            @instruments = Array.new
            @instrumentLevelHash = Hash.new
            if userInstrumentSkills != nil
                userInstrumentSkills.each do |skill|
                    ins = Instrument.find(skill.instrument_id)
---
SELECT "instruments".* FROM "instruments" INNER JOIN "instruments_users" ON "instruments"."id" = "instruments_users"."instrument_id" WHERE "instruments_users"."user_id" = ?  [["user_id", 10]]