app/controllers/users_controller.rb

    def post_login
        @user = User.find_by_login_name(params[:login_name])
---
SELECT  "users".* FROM "users"  WHERE "users"."login_name" = 'diveesh' LIMIT 1

    def display_profile
        if params[:id] != nil
            @id = params[:id]
            @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 10]]

    def edit_profile
        if session[:curr_user_id] != nil
            @user = User.find(session[:curr_user_id])
            @instruments = Instrument.all
            @genres = Genre.all
            @interests = Interest.all
            @activities = Activity.all
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 8]]
SELECT "instruments".* FROM "instruments"
SELECT "genres".* FROM "genres"
SELECT "interests".* FROM "interests"
SELECT "activities".* FROM "activities"

    def setup
        if session[:curr_user_id] != nil
            @user = User.find(session[:curr_user_id])
            if @user.profile_set
                redirect_to({action: "edit_profile"})
            else
                @instruments = Instrument.all
                @genres = Genre.all
                @interests = Interest.all
                @activities = Activity.all
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 8]]
SELECT "instruments".* FROM "instruments"
SELECT "genres".* FROM "genres"
SELECT "interests".* FROM "interests"
SELECT "activities".* FROM "activities"

    def update_profile
        user = User.find(session[:curr_user_id])
        if params[:instruments] != nil
            user.instruments = Array.new
            params[:instruments].each do |id|
                user.instruments << Instrument.find(id)
            end
        end

        if params[:genres] != nil
            user.genres = Array.new
            params[:genres].each do |id|
                user.genres << Genre.find(id)
            end
        end

        if params[:interests] != nil
            user.interests = Array.new
            params[:interests].each do |id|
                user.interests << Interest.find(id)
            end
        end

        if params[:activities] != nil
            user.activities = Array.new
            params[:activities].each do |id|
                user.activities << Activity.find(id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
SELECT "instruments".* FROM "instruments" INNER JOIN "instruments_users" ON "instruments"."id" = "instruments_users"."instrument_id" WHERE "instruments_users"."user_id" = ?  [["user_id", 1]]
SELECT "genres".* FROM "genres" INNER JOIN "genres_users" ON "genres"."id" = "genres_users"."genre_id" WHERE "genres_users"."user_id" = ?  [["user_id", 1]]
SELECT "interests".* FROM "interests" INNER JOIN "interests_users" ON "interests"."id" = "interests_users"."interest_id" WHERE "interests_users"."user_id" = ?  [["user_id", 1]]
SELECT "activities".* FROM "activities" INNER JOIN "activities_users" ON "activities"."id" = "activities_users"."activity_id" WHERE "activities_users"."user_id" = ?  [["user_id", 1]]

            user.description = desc
        end
        puts user.photo_file_name
        user.save()
---
UPDATE "users" SET "description" = ?, "level_anchor" = ?, "photo_file_name" = ?, "profile_set" = ?, "updated_at" = ? WHERE "users"."id" = 7  [["description", "Hi my name is Diveesh"], ["level_anchor", "Fair"], ["photo_file_name", "Messages Image(209992281).png"], ["profile_set", "t"], ["updated_at", "2015-08-09 00:28:35.939361"]]

    def create
        # auth_hash = request.env['omniauth.auth']

        # render :text => auth_hash.inspect
        existing_user = User.find_by_login_name(params[:login_id])
        if existing_user == nil
            new_user = User.new()
            new_user.first_name = params[:first_name]
            new_user.last_name = params[:last_name]
            new_user.login_name = params[:login_id]
            new_user.password = params[:password]
            new_user.password_confirmation = params[:confirm_password]
            new_user.profile_set = false
            new_user.level_anchor = nil
            new_user.email_address = params[:email_address]
            if !new_user.save()
---
SELECT  "users".* FROM "users"  WHERE "users"."login_name" = 'gurmeet' LIMIT 1
INSERT INTO "users" ("created_at", "email_address", "first_name", "last_name", "login_name", "password_digest", "profile_set", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)